results/mpi_benchmark/sysbench_fio/fio_cephfs/oc_sys-fio_cephfs.worker02_1threads.4/stdout
sysbench 1.0.17 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     589.28
    fsyncs/s:                     766.37

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               9.21

General statistics:
    total time:                          10.0109s
    total number of events:              13445

Latency (ms):
         min:                                    0.00
         avg:                                    0.74
         max:                                   12.58
         95th percentile:                        2.66
         sum:                                 9995.03

Threads fairness:
    events (avg/stddev):           13445.0000/0.00
    execution time (avg/stddev):   9.9950/0.00

sysbench 1.0.17 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random read test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      1555.08
    writes/s:                     0.00
    fsyncs/s:                     0.00

Throughput:
    read, MiB/s:                  24.30
    written, MiB/s:               0.00

General statistics:
    total time:                          10.0003s
    total number of events:              15553

Latency (ms):
         min:                                    0.00
         avg:                                    0.64
         max:                                   14.44
         95th percentile:                        1.01
         sum:                                 9976.94

Threads fairness:
    events (avg/stddev):           15553.0000/0.00
    execution time (avg/stddev):   9.9769/0.00

DONE